<?php
if(!defined('IN_DISCUZ')) {
    exit('Access Denied');
}
 
$sql = <<<EOF
 
DROP TABLE IF EXISTS `ng_game`;
CREATE TABLE `ng_game` (
  `gid` int(10) unsigned NOT NULL DEFAULT '0',
  `name` varchar(50) NOT NULL DEFAULT '',
  `describe` varchar(255) NOT NULL,
  `swf` varchar(125) DEFAULT NULL,
  `url` varchar(125) NOT NULL DEFAULT '',
  `img` varchar(50) NOT NULL DEFAULT '',
  `type` varchar(50) NOT NULL DEFAULT '',
  `ctype` varchar(25) NOT NULL DEFAULT 'extcredits2',
  `rate0` int(10) NOT NULL DEFAULT '0',
  `rate1` int(11) NOT NULL DEFAULT '0',
  `installed` smallint(1) unsigned NOT NULL DEFAULT '0',
  `useup` int(11) NOT NULL DEFAULT '0',
  `useup_ctype` varchar(50) NOT NULL DEFAULT 'extcredits2' COMMENT '消耗积分类型',
  `shellId` int(11) unsigned NOT NULL DEFAULT '0',
  `operation` varchar(255) NOT NULL,
  `objective` varchar(255) NOT NULL,
  PRIMARY KEY (`gid`)
) ENGINE=MyISAM;

DROP TABLE IF EXISTS `ng_game_ip`;
CREATE TABLE IF NOT EXISTS `ng_game_ip` (
  `gid` int(10) unsigned NOT NULL DEFAULT '0',
  `ip` char(15) NOT NULL DEFAULT '',
  `addTime` int(11) unsigned NOT NULL DEFAULT '0',
  KEY `gid` (`gid`)
) ENGINE=MyISAM DEFAULT CHARSET=gbk;



DROP TABLE IF EXISTS `ng_game_shell`;
CREATE TABLE `ng_game_shell` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `url` varchar(255) NOT NULL DEFAULT '''''',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1;



DROP TABLE IF EXISTS `ng_game_type`;
CREATE TABLE `ng_game_type` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(55) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1 ;


INSERT INTO `ng_game_type` VALUES (1,'动作');
INSERT INTO `ng_game_type` VALUES (2,'体育');
INSERT INTO `ng_game_type` VALUES (3,'休闲');
INSERT INTO `ng_game_type` VALUES (4,'益智');

DROP TABLE IF EXISTS `ng_game_user`;
CREATE TABLE IF NOT EXISTS `ng_game_user` (
  `uid` int(11) unsigned NOT NULL DEFAULT '0',
  `win_num` int(11) unsigned NOT NULL DEFAULT '0',
  `register` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `pid` int(11) unsigned NOT NULL DEFAULT '0',
  `lose_num` int(11) unsigned NOT NULL DEFAULT '0',
  `signin_num` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '每日签到次数统计',
  `signin_updatetime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '签到更新时间',
  PRIMARY KEY (`uid`)
) ENGINE=MyISAM;


CREATE TABLE IF NOT EXISTS `ng_game_pk` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '擂主',
  `username` varchar(20) NOT NULL DEFAULT '无名氏',
  `gid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '擂台游戏',
  `gamename` varchar(125) NOT NULL,
  `pkname` varchar(20) NOT NULL DEFAULT '无名氏' COMMENT ' 擂台名',
  `score` int(11) NOT NULL DEFAULT '0' COMMENT '擂主最高分数',
  `price` int(11) NOT NULL DEFAULT '0',
  `price_ctype` varchar(12) NOT NULL DEFAULT 'extcredits2',
  `price_ext` varchar(255) NOT NULL DEFAULT '' COMMENT '非积分奖励',
  `rate` float NOT NULL DEFAULT '0' COMMENT '税率，只在个人擂台中使用',
  `case` int(11) NOT NULL DEFAULT '0',
  `case_ctype` varchar(12) NOT NULL DEFAULT 'extcredits2',
  `number` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '参加擂台的总人次',
  `type` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '擂台类型 1：全国 2：站内 3：个人 4：战书',
  `desc` text,
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '擂台结束标志 0：未确认生效  1: 未进行奖励处理的标志 2: 当 price_ext 非空时，表示为站长进行手工处理 3: 奖励处理完成，正常结束标志 ',
  `starttime` int(11) unsigned NOT NULL DEFAULT '0',
  `endtime` int(11) unsigned NOT NULL DEFAULT '0',
  `ctime` int(11) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1 ;

CREATE TABLE IF NOT EXISTS `ng_game_pker` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `pkid` int(11) unsigned NOT NULL DEFAULT '0',
  `gid` int(11) unsigned NOT NULL DEFAULT '0',
  `status` tinyint(2) NOT NULL COMMENT '2：单挑 3：打擂',
  `act_uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '挑战者',
  `act_username` varchar(20) NOT NULL DEFAULT '无名氏',
  `act_usericon` varchar(125) NOT NULL,
  `def_uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '擂台主',
  `def_username` varchar(20) NOT NULL DEFAULT '无名氏',
  `def_usericon` varchar(125) NOT NULL,
  `act_score` int(11) unsigned NOT NULL DEFAULT '0',
  `def_score` int(11) unsigned NOT NULL DEFAULT '0',
  `ctime` int(11) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1 ;

CREATE TABLE IF NOT EXISTS `ng_game_credit` (
  `gid` int(11) unsigned NOT NULL DEFAULT '0',
  `uid` int(11) unsigned NOT NULL DEFAULT '0',
  `type` varchar(55) DEFAULT '',
  `affect` int(11) NOT NULL DEFAULT '0',
  `score` int(11) unsigned NOT NULL DEFAULT '0',
  `addTime` int(11) unsigned DEFAULT '0',
  `status` int(1) NOT NULL DEFAULT '1' COMMENT '单机1，个人pk2，打擂3',
  `pker_id` int(10) NOT NULL COMMENT '关联pker表id',
  KEY `uid` (`uid`),
  KEY `gid` (`gid`),
  KEY `pker_id` (`pker_id`)
) ENGINE=MyISAM;


CREATE TABLE IF NOT EXISTS `ng_game_reply` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(11) unsigned NOT NULL DEFAULT '0',
  `username` varchar(20) NOT NULL DEFAULT '无名氏',
  `userphoto` varchar(200) NOT NULL DEFAULT '',
  `gid` int(11) unsigned NOT NULL DEFAULT '0',
  `title` varchar(255) NOT NULL DEFAULT '无标题',
  `content` text NOT NULL,
  `ctime` int(11) unsigned NOT NULL DEFAULT '0',
  `validate` smallint(1) unsigned DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1 ;

INSERT INTO `ng_game` VALUES (40312,'只有5秒','给你五秒，你能成功闪躲，躲开这些红球的追击吗？你的动作一定要迅速啊，否则你会死掉的哦！','game/2012/7/4/20120704173244222.swf','1000','game/2012/7/4/20120704173244222.jpg','4','extcredits2',100,15,1,10,'extcredits2',1,'鼠标移动代表你的小圆点','移动代表你的小圆点，触碰到绿色的小球，需在五秒内完成，否则游戏结束，千万不要碰到红球，否则游戏结束'),(40311,'小兔跳叮当','这是一个简单而又好玩的舒闲游戏，这个游戏的特点是它那动听的背景音乐，在你闲下心来的时候打开来玩是个不错的选择哦！','game/2012/7/4/20120704172621175.swf','1000','game/2012/7/4/20120704172621175.jpg','3','extcredits2',500000,15,1,10,'extcredits2',2,'游戏加载完毕点击两次游戏界面即可开始游戏','让可爱的小兔子一直往上跳，赢取更高的分数'),(40310,'小鸡洗澡','好多可爱的小鸡啊，一起来给它们洗澡吧，不过要注意看准时机，要迅速把小鸡们从澡盆里捞出来，不然就会被淹死啊。看看你到底能够抓住几只小鸡。','game/2012/7/4/20120704172240909.swf','1000','game/2012/7/4/20120704172240909.jpg','3','extcredits2',1000,15,1,10,'extcredits2',3,'游戏载入后，点击“开始”进行游戏','鼠标左键点击，控制抓住从澡盆跳出的小鸡，然后放到笼子里'),(40308,'武林足球_积分','一款华丽的足球游戏，考验你的足球技能，能否成为足球小将就看你的了。','game/2012/7/4/20120704171739316.swf','1000','game/2012/7/4/20120704171739316.jpg','1','extcredits2',20000,15,1,10,'extcredits2',4,'游戏加载完成后点击两次“开始游戏”按钮即可游戏','用精准的技能将足球射入球门'),(40307,'五连方块','类似于五子棋。游戏中你需要将相同的五个方块连成一排或者一列，这样就可以消去，把画面内所有的方块消除就可以过关','game/2012/7/4/20120704171558863.swf','1000','game/2012/7/4/20120704171558863.jpg','1','extcredits2',1000,15,1,10,'extcredits2',5,'点击要移动的方块，再点击要移动的空地，就可以完成移动','努力消除游戏中所有的方块，将横、竖或斜线的5个或5个以上同色方块连成不间断的一排即可得分'),(40306,'霜冻天使','优美的音乐，唯美的森林里冰凌天使美雪儿的任务就是将漫天落叶变成冰凌美雪，将同种类的落叶圈在一个封闭的圈里就可以变成美雪了！','game/2012/7/4/20120704171419191.swf','1000','game/2012/7/4/20120704171419191.jpg','3','extcredits2',50000,15,1,10,'extcredits2',6,'游戏加载完成后点击START - 然后点击NEXT - 再点击START即可开始游戏','在规定的时间内，让更多的叶子变成雪花，赢取更高的分数哦！'),(40305,'鼠标球_积分','一款家喻户晓的游戏，利用挡板弹回小球打砖块，不要让小球掉到挡板下面去了。','game/2012/7/4/20120704171108863.swf','1000','game/2012/7/4/20120704171108863.jpg','4','extcredits2',15000,15,1,10,'extcredits2',7,'游戏加载完毕点击[开始游戏]即可开始游戏','成功地打掉所有的砖块即可进入下一关！'),(40304,'猫和老鼠_积分','扮演老鼠就去偷奶酪，扮演猫就去抓老鼠，分为简单，中等难度，困难三个等级，觉得好玩的话就来向难度高的等级挑战吧！','game/2012/7/4/20120704170904597.swf','1000','game/2012/7/4/20120704170904581.jpg','3','extcredits2',1500,15,1,10,'extcredits2',8,'游戏加载完毕点击PLAY - 然后选择猫或者老鼠 - 再选择难度 - 接着点击START即可开始游戏','成功躲避所有的攻击将所有的奶酪偷到手，或者干掉所有偷奶酪的老鼠吧！'),(40303,'牛奶连连看','奶牛连连看是一款经典的连连看小游戏，里面的图案都很可爱哦，赶紧来试试吧！','game/2012/7/4/20120704170240738.swf','1000','game/2012/7/4/20120704170240738.jpg','4','extcredits2',10000,15,1,10,'extcredits2',9,'鼠标左键点击两个相同图案，如果图案间的连线转折不超过2次并且不经过其他图案，即可消除。还可以使用“重列”道具进行帮助哦。','在限定时间内，消除所有相同的图案吧。'),(40301,'极地扔企鹅','极地扔企鹅勋章版，你有没有尝过一个人站在漂浮的冰块上，然后还要把企鹅抛得高高的。要研究一下脚下的浮冰的运动，然后以它的运动作为参照物配合判断你出手的时机。快来挑战看看吧！','game/2012/7/4/20120704164305316.swf','1000','game/2012/7/4/20120704164305316.jpg','2','extcredits2',1500,15,1,10,'extcredits2',10,'游戏加载完毕即可开始游戏','尽可能地将企鹅抛得更高，挑战更高的分数吧！'),(40299,'躲猫猫','勇敢的天使挑战坏坏的企鹅，善良的天使不愿意伤害企鹅，所以只能逃跑。','game/2012/7/4/20120704163713394.swf','1000','game/2012/7/4/20120704163713394.jpg','3','extcredits2',5000,15,1,10,'extcredits2',11,'戏加载完成后点击右下角第一个按钮开始游戏','敏捷低躲避企鹅，挑战一下高分数吧！'),(40297,'打企鹅','雪人和企鹅在南极呆的很无聊，居然自己玩起了击打游戏，企鹅做成的小球能被雪人击得多远呢？看看你能破纪录吗','game/2012/7/4/20120704163118659.swf','1000','game/2012/7/4/20120704163118659.jpg','4','extcredits2',1500,15,1,10,'extcredits2',12,'鼠标点击击出棍子','将企鹅击打得越远越好'),(40296,'台球-斯洛克','一款非常经典的台球游戏，看看你的实力如何，能否尽快把球都打进洞呢？赶紧来尝试一下吧，挑战一下自己的实力！','game/2012/5/23/20120523092948012.swf','1000','game/2012/5/23/20120523092948012.jpg','2','extcredits2',50000,15,1,10,'extcredits2',13,'瞄准后用鼠标拉动球杆击球','将全部台球准确的击入球洞，母球被击入球洞则会扣除相应分数，在规定时间内将台球击入球洞还会获得分数奖励，时间耗尽则游戏结束'),(40295,'牵手找朋友','这是一个关于牵手的游戏，在这茫茫人海芸芸众生中，你能牵手到你想要的朋友和爱人吗？其实，人和人之间的缘分很奇妙，对于有缘之人，冥冥之中总会有一根线把他们牵在一起，你觉得呢？','game/2012/5/23/20120523092522314.swf','1000','game/2012/5/23/20120523092522314.jpg','4','extcredits2',150000,15,1,10,'extcredits2',14,'鼠标点击画线，将穿一样服饰的人物或者发型一样的人物连接在一起','将穿一样服饰的人物或者发型一样的人物连接在一起，注意千万不要使线交叉，同时，牵到错误的人时会重新开始，注意有时间限制哦'),(40294,'大兵快跑','战场上流弹这么多，跑快点才能保证不被流弹打中吧，而且，你的战友在不断的减少，心情该多糟糕啊，赶紧逃命吧。','game/2012/5/23/20120523092028764.swf','1000','game/2012/5/23/20120523092028764.jpg','3','extcredits2',10000,15,1,10,'extcredits2',15,'左右键移动大兵，上下键是大兵分开或靠拢','移动大兵避开流弹等物体的袭击，注意，每一段路程都会不断有大兵加入快跑队伍中，你要注意每一位大兵的安全哦，大兵越多分数涨得越快哦'),(40293,'重打兔子','来一起击打兔子不，千万不要让他碰死在墙上哦，要将它们弹入小洞里才算成功哦，有一定难度哦！','game/2012/5/14/20120514115326885.swf','1000','game/2012/5/14/20120514115326869.jpg','3','extcredits2',50,15,1,10,'extcredits2',16,'方向键←→键控制左右移动，空格键击打兔子。注意：兔子碰死在墙上减少一条生命，被弹入小洞里可增加时间。','将更多的兔子准确的弹入小洞，挑战更高的分数吧！'),(40292,'小熊版俄罗斯方块','这是一款可爱的俄罗斯方块小游戏，喜欢玩俄罗斯方块的小朋友过来玩吧！','game/2012/5/14/20120514112109963.swf','1000','game/2012/5/14/20120514112109963.jpg','4','extcredits2',2000,15,1,10,'extcredits2',17,'键盘方向键←→控制方块移动，↑键变形，↓键加速下落。填满一行即可消除方块。','尽可能地消除更多的方块，挑战高分吧！'),(40291,'猴子捞月','猴子想要捞起水中的星星，于是它在想各种办法，奇怪的是它的影子，真的可以捞到星星！','game/2012/5/14/20120514094644322.swf','1000','game/2012/5/14/20120514094644322.jpg','3','extcredits2',1500,15,1,10,'extcredits2',18,'移动鼠标控制猴子移动，点击左键蓄力，释放鼠标即可控制猴子捞星星。','帮助小猴子捞到更多的星星，获得更高的挑战分数吧！'),(40290,'彩虹糖果机','【彩虹糖果机勋章版】喜欢吃糖果吗？这里有像彩虹一样的美味糖果！它们在糖果机里跳来跳去，香甜诱人，你有没有流口水呢？一起来玩一玩吧！','game/2012/5/11/20120511112820338.swf','1000','game/2012/5/11/20120511112820338.jpg','4','extcredits2',1000,15,1,10,'extcredits2',19,'鼠标点击消除糖果，三个或三个以上的相同糖果连在一起即可消除并增加时间。','在限定时间内，尽可能地消除更多的糖果，挑战高分吧！'),(40289,'史卢比投篮球','可爱的史努比正在练习投篮，你也一起来和他比比吧。要用你的智慧巧投篮哦，看谁投得又快又准。','game/2012/5/7/20120507102503237.swf','1000','game/2012/5/7/20120507102503237.jpg','2','extcredits2',2000,15,1,10,'extcredits2',20,'鼠标点击投篮，第一次点确定角度，第二次控制力度','利用鼠标控制角度和力度，确定好角度和力度后将球投到篮筐内，篮球进框才会得分哦'),(40288,'旋转水果','小家伙想吃水果，要怎么才能把水果从树上摘到包里呢？这就得看你的反应能力了，速度一定要快啊！','game/2012/5/7/20120507095337034.swf','1000','game/2012/5/7/20120507095337034.jpg','4','extcredits2',30000,15,1,10,'extcredits2',21,'点击“开始”进行游戏\n鼠标左键控制周围四个水果旋转','鼠标点击水果旋转，几个相同水果碰在一起则会获得积分，时间耗尽则游戏结束'),(40287,'小兔过河','唯美清新，梦幻画风...绒兔儿雪白雪白的，柔软可爱，颈上系上粉色蝴蝶结，真是漂亮啊！小兔子喜欢彩蛋，跳过悬崖去拿，你要用木板做它们的跳台，不要让可爱小兔子掉到水里去啦！鼠标操作，试下你能拿多少分？','game/2012/5/7/20120507092856956.swf','1000','game/2012/5/7/20120507092856956.jpg','3','extcredits2',15000,15,1,10,'extcredits2',22,'游戏加载完成后，点击START GAME → PLAY NOW，即可进入游戏。','利用木板做跳台，让小兔子顺利跳过悬崖，获得高分数。'),(40286,'记忆翻牌','一款简单的记忆翻牌游戏，找到两个相同的图片，你需要多久才能找出所有的牌呢？','game/2012/5/2/20120502092953968.swf','1000','game/2012/5/2/20120502092953968.jpg','4','extcredits2',10000,15,1,10,'extcredits2',23,'单击盖着的卡片显示一种动物的头像或物品。','翻开所有的牌'),(40285,'枪手养成记','想成为神枪手可不是那么容易的事情！你要把枪法练好就要不停的练习，练习，从现在开始。下面，请瞄准酒瓶进行射击吧！','game/2012/5/2/20120502091816100.swf','1000','game/2012/5/2/20120502091816100.jpg','2','extcredits2',5000,15,1,10,'extcredits2',24,'移动鼠标，点击抛出空中的瓶子将其击爆，没有子弹后按空格键可以装子弹','在一定的时间内击中跟多的瓶子，你一定可以！'),(40283,'躲弹球','别看这个小姑娘长得很萌就以为这个游戏很简单了！其实完全不是的，游戏很考验你的反应力和敏捷度哦！来吧，帮助小姑娘躲开弹球的攻击吧！','game/2012/4/25/20120425101903739.swf','1000','game/2012/4/25/20120425101903739.jpg','1','extcredits2',10000,10,1,10,'extcredits2',25,'移动小姑娘\n左右键移动小姑娘','移动小姑娘躲避弹球，被弹球砸中游戏会结束'),(40282,'下100层','想挑战极限吗？有本事就下100层吧！跳跃层层障碍，人人都可以成为英雄。要注意不能踩空。小心带刺的踏板和上方的电流。','game/2012/4/25/20120425101317864.swf','1000','game/2012/4/25/20120425101317848.jpg','3','extcredits2',50,15,1,10,'extcredits2',26,'使用键盘← →控制小人的方向','快速下跳，注意每一种承载物都有不同的作用，有的是带来伤害，有的是帮助小人回血，你要注意避开伤害，千万不要落空哦'),(40281,'饥饿的鲨鱼','饥饿的小鲨鱼在海中觅食，它只能吃下比自己小的鱼，在不断的闯关中，鲨鱼会逐渐变成大鲨鱼。','game/2012/3/28/20120328143112360.swf','1000','game/2012/3/28/20120328143112344.jpg','1','extcredits2',3000,15,1,10,'extcredits2',27,'方向键控制鲨鱼方向。道具：保护蟹：得到它自身会形成保护膜。鱿鱼计算器：得到它时间将静止。','吃掉比自己小的鱼，慢慢变大，进入下一关。'),(40280,'灌篮高手','他是学校里的灌篮高手，如今面对不断移动的篮筐，这位帅气的男孩能投进去多少球呢？','game/2012/3/28/20120328142913579.swf','1000','game/2012/3/28/20120328142913579.jpg','2','extcredits2',50000,15,1,10,'extcredits2',28,'投出球后，鼠标控制人移动，把球捡起来继续投篮','将球投入篮筐，限定时间内中的越多分数越高，连击可以获得更高的分数'),(40279,'走钢丝','醉汉喝醉了，即便这样，他还是喜欢做危险的事情，比如说走钢丝，走在这样细的钢丝上，他能成功到达终点吗？路途中，会有谁来助他一臂之力呢？','game/2012/3/28/20120328142521454.swf','1000','game/2012/3/28/20120328142521454.jpg','2','extcredits2',50,15,1,10,'extcredits2',29,'鼠标左右移动控制平衡','控制好平衡，帮助醉汉走得更远，有鸟儿落在竹竿上的时候记得往相反方向倾斜'),(40278,'黄金矿工','红色炸弹、黄色瓶子、ROCKS、优质钻石、幸运草等你慢慢发掘。还等什么？准备出发上路，做一个淘金者！','game/2012/3/28/20120328142244750.swf','1000','game/2012/3/28/20120328142244750.jpg','3','extcredits2',10000,15,1,10,'extcredits2',30,'按下键开使捞金子，如有炸弹，按上键放炸弹，买东西点鼠标单击左键','在规定时间内捞到足够的金子通关，捞到金子越多分数越多，在每次通关可以买道具帮助下一关'),(40277,'史努比投标枪','可爱的史努比在这次也参加了标枪大赛，作为控制它的你，能帮助它取得好成绩吗？','game/2012/3/28/20120328142021516.swf','1000','game/2012/3/28/20120328142021516.jpg','2','extcredits2',41000,15,1,10,'extcredits2',31,'鼠标点击操作','鼠标点击让史努比准确的投射标枪，按住鼠标则可调整角度，投射角度会直接影响到投射距离，投射距离越远则分数越高'),(40276,'空中大冒险','亚梦在上海的外滩开始了新的旅行！~~她需要吃食物来补充体力，有桔子、冰激凌、小熊蛋糕等多种食物，小鸟可以加速，太阳可以补充体力。','game/2012/3/28/20120328141343110.swf','1000','game/2012/3/28/20120328141343110.jpg','1','extcredits2',3000,15,1,10,'extcredits2',32,'鼠标控制亚梦移动，鼠标左键可以跳跃。','接住食物。'),(40275,'瓢虫大逃亡','你是一只在春天的怀抱下刚刚长成的七星瓢虫，每天自由自在地生活，可是可恶的小羊想要抓你，他使出浑身解数，你要赶快逃跑哦～','game/2012/3/28/20120328140708063.swf','1000','game/2012/3/28/20120328140708063.jpg','3','extcredits2',300,15,1,10,'extcredits2',33,'鼠标控制瓢虫移动','鼠标就是瓢虫，要及时躲避可恶的小羊。'),(40274,'小猴儿跳墩','一个考验你判断力的游戏。精美的画面，加上弦鼓的声音，跳的越高，分数越高，快帮这只可爱的小猴子跳得更高吧！','game/2012/3/28/20120328140331782.swf','1000','game/2012/3/28/20120328140331782.jpg','3','extcredits2',2000,15,1,10,'extcredits2',34,'使用空格键或者点击鼠标左键来控制小猴的跳跃','让小猴顺利沿着石墩往上跳，共有5次失败机会，跳跃次数越多则分数越高'),(40273,'兔八哥吃萝卜','这一款游戏的主角是大家所熟知的兔八哥，它调皮又可爱，最喜欢吃的就是胡萝卜','game/2012/3/28/20120328140024063.swf','1000','game/2012/3/28/20120328140024063.jpg','3','extcredits2',1000,15,1,10,'extcredits2',35,'鼠标左键点击控制兔子跳跃，鼠标移动控制兔子的位置','弹跳越过障碍，争取吃到更多的胡萝卜到达终点'),(40272,'特技自行车','尽管这是一个人的摩托车表演赛，可是，路途却不像你想象中的那么简单，你的任务并不轻松，不管怎样，还是祝你好运。','game/2012/3/28/20120328135815438.swf','1000','game/2012/3/28/20120328135815438.jpg','2','extcredits2',4000,15,1,10,'extcredits2',36,'上下键移动，左右键控制平衡，P键暂停','在保持自行车平稳的前提下，将自行车开到终点'),(40271,'贪食蛇','流畅度超高的经典贪食蛇游戏！和其他的贪吃蛇游戏一样，用你的鼠标导引着果冻蛇的方向，不要兴奋过头撞上墙哦~','game/2012/3/28/20120328135657250.swf','1000','game/2012/3/28/20120328135657250.jpg','1','extcredits2',10,15,1,10,'extcredits2',37,'方向键控制贪吃蛇移动','不要撞到墙、自己和黑洞'),(40269,'曼妮的浴室','根据游戏画面右边物品剪影的提示，找出曼妮浴室里相对应的物品 ，点击后物品自动归位，全部找齐后进入下一关','game/2012/3/28/20120328134759391.swf','1000','game/2012/3/28/20120328134759391.jpg','3','extcredits2',20000,15,1,10,'extcredits2',38,'鼠标点击操作，寻找浴室中的物品，放到指定的地点。','帮助曼妮整理浴室。'),(40268,'火焰山','话说唐三藏师徒四人跋山涉水，斩妖除魔，历尽千辛万苦终于天竺在望。没想到却出现了一股时空乱流，接下来发生什么了呢？','game/2012/3/28/20120328134144657.swf','1000','game/2012/3/28/20120328134144657.jpg','1','extcredits2',1000,15,1,10,'extcredits2',39,'方向键控制主角移动， Z键主角开火， X键大招，长按Z键增加仙力，仙力到极限后松开，可召唤援兵。另有加保护罩、增加能量、加强火力、获得援助的道具','帮助消灭敌人'),(40267,'海绵宝宝训练营','海绵宝宝最近迷上了射击运动，每天都在菠萝屋门前练习，派大星乘坐五彩靶心也来助阵。','game/2012/3/28/20120328133957485.swf','1000','game/2012/3/28/20120328133957469.jpg','2','extcredits2',50000,15,1,10,'extcredits2',40,'点击鼠标发射弓箭','游戏用鼠标点击海绵宝宝，用剑射击五彩靶心，命中三次即可晋级。'),(40266,'坚持50秒','如果你能达到18秒以上，你算得上是个天才。据说，美国空军的飞行员被强制达到2分钟。发给你的朋友一块玩吧！','game/2012/3/27/20120327144048016.swf','1000','game/2012/3/27/20120327144048016.jpg','1','extcredits2',1000,10,1,0,'extcredits2',41,'鼠标移动到红色部分。拖动红块，避免碰到蓝色部分。不要碰到黑色区域。','躲避蓝色图形，并且不能碰到边界'),(40265,'帮企鹅攀岩','雪人和小企鹅是好朋友，因为这样的关系，在企鹅学会攀岩的时候，雪人会尽可能的帮助它，可是，雪人想帮它有时也会有心无力，你来试试吧！','game/2012/3/27/20120327143559898.swf','1000','game/2012/3/27/20120327143559898.jpg','1','extcredits2',1000,10,1,0,'extcredits2',42,'鼠标点击扔出冰锥','在合适的高度扔出冰锥，让企鹅可以借助冰锥跳到更高的地方，你只有12次扔冰锥的机会，每次企鹅最多只能跳1.2米，冰锥扔完游戏结束'),(40264,'热血棒球','这里即将上演一场精彩的棒球比赛，现在该轮到你上场了，看看你能击中几个球呢，越准确分数越高。','game/2012/3/27/20120327142044256.swf','1000','game/2012/3/27/20120327142044256.jpg','2','extcredits2',1000,10,1,0,'extcredits2',43,'鼠标左键击球','移动好位置，点击鼠标左键击打棒球，打到球数越多则分数越高，共有三次失败机会，机会耗尽则游戏结束'),(40263,'掘金勇士','鼠标点击发射，可敲击两块以上相邻矿石，金块及特殊矿石有价值，过关时空地可得分','game/2012/3/9/20120309094351498.swf','1000','game/2012/3/9/20120309094351482.jpg','4','extcredits2',35000,15,1,10,'extcredits2',44,'鼠标点击发射','努力消除全部的矿石。每扔出一次斧头会扣除一分，消除金色矿石和有价值的矿石则会加分，一次消除的矿石越多获得的分数也就越高。'),(40262,'星际弹球','一款经典的打砖块游戏，简单的打砖块游戏，画面很经典，你一定会喜欢的！加油吧！','game/2012/2/29/20120229113329355.swf','1000','game/2012/2/29/20120229113329355.jpg','4','extcredits2',6000,15,1,10,'extcredits2',45,'方向键控制移动，空格键发射子弹','运用弹球消灭飞在天上独眼怪，共有5条生命，打到上面的方块有几率掉落道具，杀死独眼怪则进入下一关，生命用完则游戏结束。'),(40261,'完美停车','控制汽车顺利停入车位，不要有任何碰撞，时间越短得分会越多。障碍物可能不会仅仅是静止的汽车和房屋障碍，还会有流浪来的野狗，路过的盲人，甚至是夺命杀手射来的子弹噢。','game/2012/2/29/20120229113234277.swf','1000','game/2012/2/29/20120229113234277.jpg','2','extcredits2',1000,10,1,0,'extcredits2',46,'↑键前进，↓键刹车，→控制右转，←键控制左转，空格键鸣笛或使用武器。','在指定时间内方向键控制车辆停到指定位置，撞到障碍物或是其他车辆都将导致游戏结束'),(40260,'十滴水','一个非常令人上瘾的游戏，你必须去填补水滴直到爆炸，获得连锁反应，将所有的水珠全部消去！鼠标单击操作来填充水珠使水珠爆破产生连锁反应，利用连锁反应消掉全部水珠。','game/2012/2/29/20120229113051387.swf','1000','game/2012/2/29/20120229113051387.jpg','4','extcredits2',20000,15,1,10,'extcredits2',47,'鼠标单击操作来填充水珠','点击水珠使水珠爆破产生连锁反应，利用连锁反应消掉全部水珠'),(40259,'灵珠消消看','点击游戏中的灵珠，如果与点击的灵珠相邻的灵珠数量有2个以上，就可以消除它们。','game/2012/2/29/20120229112741480.swf','1000','game/2012/2/29/20120229112741480.jpg','4','extcredits2',1000,10,1,0,'extcredits2',48,'点击游戏中的灵珠，如果与点击的灵珠相邻的灵珠数量有2个以上，就可以消除它们。','消除所有的灵珠'),(40258,'熊猫火箭车','在规定时间内完成全程，路上吃的道具越多分数越高，期间可以使用空格加速。','game/2012/2/28/20120228195005667.swf','1000','game/2012/2/28/20120228195002858.jpg','4','extcredits2',200000,15,1,10,'extcredits2',49,'方向键↑跳，方向键→前进，空格键使用火箭加速','在规定时间内完成全程，路上吃的道具越多分数越高，期间可以使用空格加速'),(40257,'钓鱼游戏','鼠标操作，当钓到垃圾时会扣分，钓一样的鱼是双倍分数。','game/2012/2/28/20120228194603867.swf','1000','game/2012/2/28/20120228194603055.jpg','4','extcredits2',1000,10,1,0,'extcredits2',50,'移动鼠标控制船的行驶，鼠标左键控制垂钓深度','在规定时间内钓最多的鱼，钓鱼数越多则分数越高，钓到垃圾会扣除相应分数，被雷劈中也会减少相应时间'),(40256,'绿光猴大战病毒','绿光猴选武器杀光小人来过关，在电脑桌面上玩你的游戏，很是过瘾！一开始武器是锁住，需要过关才能使用。在黄色楼梯处可以快速上下，不同武器对付不同的小人，打击大BOSS才能出现出口。试下你能过多少关吧。','game/2012/2/16/20120216194603868.swf','1000','game/2012/2/16/20120216194603055.jpg','1','extcredits2',50000,15,1,10,'extcredits2',51,'游戏使用键盘方向键控制，W 或 S 用尾巴攻击，Q 或 A 使用武器攻击。','消灭所有小人和巫师后进入旋转的圆圈开始下一关。'),(5296,'乌龟搭桥','刚从机车上下来就遇到了一条大河，幸亏有乌龟给搭桥才能顺利的通过，不过由于行李太多又不能一次性搬完所以要一次次的返回，踩在乌龟的背上过河搬运行李，快来试试吧！','game/2012/3/27/20120327143034096.swf','1000','game/2012/3/27/20120327143034096.jpg','3','extcredits2',1000,10,1,0,'extcredits2',52,'使用左右键移动，到达对岸立刻返回，掌握乌龟吃食的时间。','踩在乌龟的背上过河搬运行李');

INSERT INTO `ng_game_shell` (`id`, `url`) VALUES
(1, 'apps/2012/7/4/20120704162829597.swf'),
(2, 'apps/2012/7/4/20120704162810238.swf'),
(3, 'apps/2012/7/4/20120704162750144.swf'),
(4, 'apps/2012/7/4/20120704162709909.swf'),
(5, 'apps/2012/7/4/20120704162647019.swf'),
(6, 'apps/2012/7/4/20120704161723738.swf'),
(7, 'apps/2012/7/4/20120704161654988.swf'),
(8, 'apps/2012/7/4/20120704152913706.swf'),
(9, 'apps/2012/7/4/20120704152830331.swf'),
(10, 'apps/2012/7/4/20120704152213847.swf'),
(11, 'apps/2012/7/4/20120704152123238.swf'),
(12, 'apps/2012/7/4/20120704151818753.swf'),
(13, 'apps/2012/5/23/20120523092803077.swf'),
(14, 'apps/2012/5/23/20120523092332206.swf'),
(15, 'apps/2012/5/23/20120523091825731.swf'),
(16, 'apps/2012/5/14/20120514114950572.swf'),
(17, 'apps/2012/5/14/20120514104105041.swf'),
(18, 'apps/2012/5/14/20120514093546666.swf'),
(19, 'apps/2012/3/29/20120329172025875.swf'),
(20, 'apps/2012/5/7/20120507102231956.swf'),
(21, 'apps/2012/5/7/20120507094957034.swf'),
(22, 'apps/2012/5/7/20120507092439800.swf'),
(23, 'apps/2012/5/2/20120502091853549.swf'),
(24, 'apps/2012/5/2/20120502091320409.swf'),
(25, 'apps/2012/4/25/20120425101449270.swf'),
(26, 'apps/2012/4/25/20120425100402645.swf'),
(27, 'apps/2012/3/31/20120331094632000.swf'),
(28, 'apps/2012/3/31/20120331094350157.swf'),
(29, 'apps/2012/3/31/20120331095055500.swf'),
(30, 'apps/2012/3/31/20120331094528266.swf'),
(31, 'apps/2012/3/29/20120329163056766.swf'),
(32, 'apps/2012/3/31/20120331095043329.swf'),
(33, 'apps/2012/3/31/20120331095017547.swf'),
(34, 'apps/2012/3/31/20120331095005875.swf'),
(35, 'apps/2012/3/31/20120331094914688.swf'),
(36, 'apps/2012/3/31/20120331094900063.swf'),
(37, 'apps/2012/3/31/20120331094848157.swf'),
(38, 'apps/2012/3/31/20120331094750813.swf'),
(39, 'apps/2012/3/31/20120331094617172.swf'),
(40, 'apps/2012/3/31/20120331094513063.swf'),
(41, 'apps/2012/3/31/20120331094646000.swf'),
(42, 'apps/2012/3/29/20120329153633407.swf'),
(43, 'apps/2012/3/31/20120331094808766.swf'),
(44, 'apps/2012/3/9/20120309094208560.swf'),
(45, 'apps/2012/2/29/20120229112217918.swf'),
(46, 'apps/2012/2/29/20120229112147918.swf'),
(47, 'apps/2012/2/29/20120229112123840.swf'),
(48, 'apps/2012/2/29/20120229112101793.swf'),
(49, 'apps/2012/2/29/20120229112028012.swf'),
(50, 'apps/2012/2/29/20120229112008496.swf'),
(51, 'apps/2012/2/16/20120216194603868.swf'),
(52, 'apps/2012/3/31/20120331094951516.swf');

EOF;
 
runquery($sql);
 
$finish = TRUE;
?>